In [1]:
import pandas as pd

In [ ]:
#  df=pd.read_csv      is used to read csv file
#  pd.read_excel('myfile.xlsx',sheet_name='sheet1',index_col=None)      is used to read excel file

In [ ]:
# study which type of files pandas supports and how they are accesed
# check if we can apply lambda functions in pandas with apply

In [ ]:
# Python can work with the following file formats:

# Comma-separated values (CSV)
# XLSX
# ZIP
# Plain Text (txt)
# JSON
# XML
# HTML
# Images
# Hierarchical Data Format
# PDF
# DOCX
# MP3
# MP4
# SQL

In [ ]:
#df= dataframes

#df.head()

In [8]:
#exploring of data frames
df=pd.read_csv("wines/winequality_red.csv")
df.head(5)

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5
1,7.8,0.88,0.00,2.6,0.098,25.0,67.0,0.9968,3.20,0.68,9.8,5
2,7.8,0.76,0.04,2.3,0.092,15.0,54.0,0.9970,3.26,0.65,9.8,5
3,11.2,0.28,0.56,1.9,0.075,17.0,60.0,0.9980,3.16,0.58,9.8,6
4,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5

In [6]:
#exploring of data frames
df=pd.read_csv("top2018.csv")
df.head(6)

,id,name,artists,danceability,energy,key,loudness,mode,speechiness,acousticness,instrumentalness,liveness,valence,tempo,duration_ms,time_signature
0,6DCZcSspjsKoFjzjrWoCd,God's Plan,Drake,0.754,0.449,7.0,-9.211,1.0,0.1090,0.0332,0.000083,0.552,0.357,77.169,198973.0,4.0
1,3ee8Jmje8o58CHK66QrVC,SAD!,XXXTENTACION,0.740,0.613,8.0,-4.880,1.0,0.1450,0.2580,0.003720,0.123,0.473,75.023,166606.0,4.0
2,0e7ipj03S05BNilyu5bRz,rockstar (feat. 21 Savage),Post Malone,0.587,0.535,5.0,-6.090,0.0,0.0898,0.1170,0.000066,0.131,0.140,159.847,218147.0,4.0
3,3swc6WTsr7rl9DqQKQA55,Psycho (feat. Ty Dolla $ign),Post Malone,0.739,0.559,8.0,-8.011,1.0,0.1170,0.5800,0.000000,0.112,0.439,140.124,221440.0,4.0
4,2G7V7zsVDxg1yRsu7Ew9R,In My Feelings,Drake,0.835,0.626,1.0,-5.833,1.0,0.1250,0.0589,0.000060,0.396,0.350,91.030,217925.0,4.0
5,7dt6x5M1jzdTEt8oCbisT,Better Now,Post Malone,0.680,0.563,10.0,-5.843,1.0,0.0454,0.3540,0.000000,0.136,0.374,145.028,231267.0,4.0

In [2]:
import pandas as pd
from pandas import Series, DataFrame

#### Series:
it is 1D array like object containing a sequence

In [12]:
obj=pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [13]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [14]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [20]:
obj2=pd.Series([4,7,-5,3], index=['d','b','a','c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [21]:
print(obj2.dtype)

int64

In [24]:
obj2['d']=6
obj2[['c','a','d']]

c    3
a   -5
d    6
dtype: int64

In [25]:
obj2*2

d    12
b    14
a   -10
c     6
dtype: int64

Another way to think series as a fixed length,ordered dictionary

In [33]:
states=['a0','b','v','a']
obj3=pd.Series([4,7,-5,3], index=states)
obj3

a0    4
b     7
v    -5
a     3
dtype: int64

In [30]:
pd.isnull(obj3)

a0    False
b     False
v     False
a     False
dtype: bool

In [34]:
obj3+obj2

a     -2.0
a0     NaN
b     14.0
c      NaN
d      NaN
v      NaN
dtype: float64

### Series Allignment

In [39]:
obj3.name='pop'
obj3.index.name='sta'
obj3

sta
a0    4
b     7
v    -5
a     3
Name: pop, dtype: int64

### Data frames

In [99]:
data={'state':['anmol','anmol','anm','anm'],'year':[2000,2001,2002,2003],'pop':[1.5,1.7,2.6,3.4]}
frames=pd.DataFrame(data)

In [41]:
frames

   state  year  pop
0  anmol  2000  1.5
1  anmol  2001  1.7
2    anm  2002  2.6
3    anm  2003  3.4

In [47]:
frames.size

12

In [45]:
frames.shape

(4, 3)

In [43]:
s=pd.Series(data)
s

state    [anmol, anmol, anm, anm]
year     [2000, 2001, 2002, 2003]
pop          [1.5, 1.7, 2.6, 3.4]
dtype: object

In [46]:
s.size

3

In [48]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
k=[11,21,31,34,25]
pd.Series(k, index=['34','45','56','67','78'])

34    11
45    21
56    31
67    34
78    25
dtype: int64

In [51]:
pop=pd.Series(sdata)
pop

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [52]:
frames['an']=[4,5,6,7]

In [53]:
frames

   state  year  pop  an
0  anmol  2000  1.5   4
1  anmol  2001  1.7   5
2    anm  2002  2.6   6
3    anm  2003  3.4   7

In [58]:
frames['an+year']=frames['an']+frames['year']
frames

   state  year  pop  an   an1  an+year
0  anmol  2000  1.5   4  2004     2004
1  anmol  2001  1.7   5  2006     2006
2    anm  2002  2.6   6  2008     2008
3    anm  2003  3.4   7  2010     2010

In [56]:
frames.isnull()

   state   year    pop     an    an1
0  False  False  False  False  False
1  False  False  False  False  False
2  False  False  False  False  False
3  False  False  False  False  False

In [59]:
frames.iloc[0,2]

1.5

In [3]:
emp=pd.read_csv("http://rcs.bu.edu/examples/python/data_analysis/Salaries.csv")

In [61]:
emp

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [62]:
emp.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [63]:
emp.head(5)

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [66]:
emp['salary'].mean()

108023.78205128205

http://rcs.bu.edu/examples/python/data_analysis

In [67]:
type(emp['salary'])

pandas.core.series.Series

In [69]:
emp['salary']+emp['service']

0     187009
1      93006
2     110535
3     131236
4     104818
       ...
73    105460
74    104548
75    124329
76    109968
77    109661
Length: 78, dtype: int64

In [116]:
a=emp['salary'].replace("1","2")

In [117]:
emp=emp.replace({'salary':{90:2}})
emp

         rank discipline  phd  service     sex  salary
0        P5of          B   56       49    Male  186960
1        P5of          A   12        6    Male   93000
2        P5of          A   23       20    Male  110515
3        P5of          A   40       31    Male  131205
4        P5of          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       P5of          B   18       10  Female  105450
74  AssocP5of          B   19        6  Female  104542
75       P5of          B   17       17  Female  124312
76       P5of          A   28       14  Female  109954
77       P5of          A   23       15  Female  109646

[78 rows x 6 columns]

In [121]:
for i in range(7):
    a=(emp.iloc[i]['rank'])
    a=a.replace("o","1")
    print(a)

Pr1f
Pr1f
Pr1f
Pr1f
Pr1f
Pr1f
Ass1cPr1f

In [110]:
emp.iloc[0]['salary'].replace("1","5")

AttributeError: 'numpy.int64' object has no attribute 'replace'

### Replace a value in data

In [122]:
emp['rank']=emp['rank'].apply(removepercent)

dtype('O')

In [113]:
def removepercent(value):
    value=value.replace("r","5")
    return (value)

In [123]:
emp

         rank discipline  phd  service     sex  salary
0        P5of          B   56       49    Male  186960
1        P5of          A   12        6    Male   93000
2        P5of          A   23       20    Male  110515
3        P5of          A   40       31    Male  131205
4        P5of          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       P5of          B   18       10  Female  105450
74  AssocP5of          B   19        6  Female  104542
75       P5of          B   17       17  Female  124312
76       P5of          A   28       14  Female  109954
77       P5of          A   23       15  Female  109646

[78 rows x 6 columns]

In [128]:
emp[3:5]

   rank discipline  phd  service   sex  salary
3  P5of          A   40       31  Male  131205
4  P5of          B   20       18  Male  104800

### Difference between loc and iloc

In [136]:
emp.iloc[3:11]

         rank discipline  phd  service   sex  salary
3        P5of          A   40       31  Male  131205
4        P5of          B   20       18  Male  104800
5        P5of          A   20       20  Male  122400
6   AssocP5of          A   20       17  Male   81285
7        P5of          A   18       18  Male  126300
8        P5of          A   29       19  Male   94350
9        P5of          A   51       51  Male   57800
10       P5of          B   39       33  Male  128250

In [137]:
emp.loc[3:11]

         rank discipline  phd  service   sex  salary
3        P5of          A   40       31  Male  131205
4        P5of          B   20       18  Male  104800
5        P5of          A   20       20  Male  122400
6   AssocP5of          A   20       17  Male   81285
7        P5of          A   18       18  Male  126300
8        P5of          A   29       19  Male   94350
9        P5of          A   51       51  Male   57800
10       P5of          B   39       33  Male  128250
11       P5of          B   23       23  Male  134778

In [131]:
emp.loc[3:5,"sex"]

3    Male
4    Male
5    Male
Name: sex, dtype: object

In [138]:
#emp.iloc[3:5,"sex"]


# # ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED),
# listlike of integers, boolean array] types

In [139]:
emp.iloc[-1]

rank            P5of
discipline         A
phd               23
service           15
sex           Female
salary        109646
Name: 77, dtype: object

In [141]:
emp.loc[3:4,"phd":"salary"]

   phd  service   sex  salary
3   40       31  Male  131205
4   20       18  Male  104800

In [161]:

emp.loc[3,'sex']='Nan'

TypeError: '(slice(3, 5, 1), 1)' is an invalid key

In [13]:
def miniMaxSum(arr):
    sum=0
    sum1=[]
    for i in range(len(arr)):
        sum+=arr[i]
    for j in range(len(arr)):
        sum1.append(sum-arr[j])
    return sum1[0],sum1[-1]

arr=[1,2,3,4,5]
miniMaxSum(arr)

(14, 10)

In [15]:
def timeConversion(s):
    #
    # Write your code here.
    #
    if s[8]=="A":
        if s[0:2]=="12":
            s3="00"
            s4=str(s3)+s[2:8]
            return s4
        else:
            s=s[0:8]
            return s
    elif s[8]=="P":
        if s[0:2]=="12":
            s5=s[0:8]
            return s5
        else:
            s1=int(s[0:2])+12
            s2=str(s1)+s[2:8]
            return s2
    else :
        return s
s="12:45:54PM"

timeConversion(s)

'12:45:54'

In [34]:
string="AbBaAbBaAbBa"
sub_string="Ab"
string=string[1:]
s=string.find(sub_string,1)
string.find?

print( s)

3